tap "adoptopenjdk/openjdk"
tap "dart-lang/dart"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/php"
tap "homebrew/services"
tap "puma/puma"
# Classic UNIX line editor
brew "ed", args: ["with-default-names"]
# AdoptOpenJDK main binary releases for OpenJDK 10 with HotSpot
brew "adoptopenjdk-openjdk10"
# Download with resuming and segmented downloading
brew "aria2"
# General-purpose data compression with high compression ratio
brew "xz"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Dependency Manager for PHP
brew "composer"
# Asynchronous event library
brew "libevent"
# Monitor DHCP traffic for debugging purposes
brew "dhcpdump"
# Isolated development environments using Docker
brew "docker-compose"
# Docker Machine Parallels Driver
brew "docker-machine-parallels"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Utility to determine file types
brew "file-formula"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Ruby client and CLI for GitLab API
brew "gitlab-gem"
# Version Control Visualization Tool
brew "gource"
# Apply a diff file to an original
brew "gpatch"
# Colorize logfiles and command output
brew "grc"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Popular GNU data compression program
brew "gzip"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Image processing tools collection
brew "graphicsmagick"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Convert JPG images to ASCII
brew "jp2a"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# List USB devices, just like the Linux lsusb command
brew "lsusb"
# Text-based web browser
brew "lynx"
# Macro processing language
brew "m4"
# Utility for directing compilation
brew "make"
# High-performance, schema-free, document-oriented database
brew "mongodb"
# Recursively compute digests on files/directories
brew "md5deep"
# Fast and user friendly build system
brew "meson"
# Lightweight text-to-speech engine based on CMU Flite
brew "mimic"
# Text to speech, software speech synthesizer
brew "espeak"
brew "prettyping"
# Scriptable ping program for checking if multiple hosts are up
brew "fping"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Web server scanner
brew "nikto"
# Password generator
brew "pwgen"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Shell command parallelization utility
brew "parallel"
# Tool to automatically fix PHP coding standards issues
brew "php-cs-fixer"
# Programmer-oriented testing framework for PHP
brew "phpunit"
# Object-relational database system
brew "postgresql"
# Rsync for cloud storage
brew "rclone"
# Unit testing tool
brew "roundup"
# Utility that provides fast incremental file transfer
brew "rsync"
# Diff images from the command-line
brew "spaceman-diff"
# Sparklines for the shell
brew "spark"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Command-line tool to manage your ssh connections
brew "stormssh"
# Bring your .bashrc, .vimrc, etc. with you when you SSH
brew "sshrc"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# Extraction utility for .zip compressed archives
brew "unzip"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# The Dart SDK
brew "dart-lang/dart/dart"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Command-line interface for WordPress
brew "wp-cli"
# HTTP benchmarking tool
brew "wrk"

