tap "AdoptOpenJDK/openjdk"
tap "dart-lang/dart"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "puma/puma"
tap "mas-cli/tap", pin: true
## Shell
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Program that can automate interactive applications
brew "expect"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Classic UNIX line editor
brew "ed"
brew "readline" # ensure gawk gets good readline
# General-purpose data compression with high compression ratio
brew "xz"
# Search tool like grep, but optimized for programmers - http://conqueringthecommandline.com/book/ack_ag
brew "ack"
brew "ag"
# alternative to `cat`: https://github.com/sharkdp/bat
brew "bat"
# Install GNU core utilities (those that come with macOS are outdated)
brew "coreutils"
brew "dos2unix"
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew "findutils"
# GNU awk utility
brew "gawk"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# C code prettifier
brew "gnu-indent"
# Install GNU `sed`, overwriting the built-in `sed`
# so we can do "sed -i 's/foo/bar/' file" instead of "sed -i '' 's/foo/bar/' file"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of which utility
brew "gnu-which"
# upgrade grep so we can get things like inverted match (-v)
brew "grep"
# Utility for directing compilation
brew "make"
brew "cmake"
# GNU Emacs text editor
brew "emacs"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Install some other useful utilities like `sponge`
brew "moreutils"
brew "binutils"
brew "diffutils"
# Color-highlighted diff(1) output
brew "colordiff"
brew "diff-so-fancy"
# Internet file retriever
brew "wget"
# Download with resuming and segmented downloading
brew "aria2"
# Bash script to format a block device to UDF
brew "format-udf"
# https://github.com/jkbrzt/httpie
brew "httpie"
# Organize Your macOS Launchpad Apps
brew "blacktop/tap/lporg"
brew "openconnect"
brew "reattach-to-user-namespace"
# better/more recent version of screen
brew "screen"
brew "tmux"
brew "todo-txt"
brew "tree"
brew "ttyrec"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Official Amazon AWS command-line interface
brew "awscli"
# Mac App Store CLI: https://github.com/mas-cli/mas
brew "mas"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"

## Languages
# Interpreted, interactive, object-oriented programming language
brew "python"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Highly capable, feature-rich programming language
brew "perl@5.18"
# Platform built on V8 to build network applications
brew "node"
# Ruby version manager
brew "rbenv"
brew "ruby"


## Servers
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Drop-in replacement for MySQL
brew "mariadb"
# High-performance, schema-free, document-oriented database
brew "mongodb"
# Object-relational database system
brew "postgresql"
# Persistent key-value database, with built-in net interface
brew "redis"

# Dependency Manager for PHP
brew "composer"
# Asynchronous event library
brew "libevent"
# Monitor DHCP traffic for debugging purposes
brew "dhcpdump"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Utility to determine file types
brew "file-formula"

## Git addons
# Distributed revision control system
brew "git"
brew "bfg"
brew "git-extras"
brew "git-flow"
# Git extension for versioning large files"
brew "git-lfs"
# Ruby client and CLI for GitLab API
brew "gitlab-gem"
# Add GitHub support to git on the command-line
brew "hub"

## Security
brew "pass"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Recursively compute digests on files/directories
brew "md5deep"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Zip password cracker
brew "fcrackzip"
# Port scanning utility for large networks
brew "nmap"
# Network logon cracker which supports many services
brew "hydra"
# Featureful UNIX password cracker
brew "john"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Swiss army knife for network attacks and monitoring
brew "bettercap"



# Utilities
# Configure transparent encryption of files in a Git repo
brew "transcrypt"
# Improved top (interactive process viewer)
brew "htop"
# Version Control Visualization Tool
brew "gource"
# Apply a diff file to an original
brew "gpatch"
# Colorize logfiles and command output
brew "grc"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Popular GNU data compression program
brew "gzip"
# Image processing tools collection
brew "graphicsmagick"
# Tools and libraries to manipulate images in many formats
brew "imagemagick" # needed to support gitshots
# Tool to capture still images from an iSight or other video source
brew "imagesnap" # needed to support gitshots
# Convert JPG images to ASCII
brew "jp2a"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# List USB devices, just like the Linux lsusb command
brew "lsusb"
# Text-based web browser
brew "lynx"
# Macro processing language
brew "m4"
# Web server access log visualizer with retro style
brew "logstalgia"
# Fast and user friendly build system
brew "meson"
# Lightweight text-to-speech engine based on CMU Flite
brew "mimic"
# Text to speech, software speech synthesizer
brew "espeak"
brew "prettyping"
  # Utilities
# Scriptable ping program for checking if multiple hosts are up
brew "fping"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Web server scanner
brew "nikto"
# Password generator
brew "pwgen"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Shell command parallelization utility
brew "parallel"
# Tool to automatically fix PHP coding standards issues
brew "php-cs-fixer"
# Programmer-oriented testing framework for PHP
brew "phpunit"
# Rsync for cloud storage
brew "rclone"
# Unit testing tool
brew "roundup"
# Utility that provides fast incremental file transfer
brew "rsync"
# Diff images from the command-line
brew "spaceman-diff"
# Sparklines for the shell
brew "spark"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Command-line tool to manage your ssh connections
brew "stormssh"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Bring your .bashrc, .vimrc, etc. with you when you SSH
brew "sshrc"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# Extraction utility for .zip compressed archives
brew "unzip"
# Display word differences between text files
brew "wdiff"
# Download YouTube videos from the command-line
brew "youtube-dl"
# The Dart SDK
brew "dart-lang/dart/dart"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Command-line interface for WordPress
brew "wp-cli"
# HTTP benchmarking tool
brew "wrk"
# Programatically correct mistyped console commands
brew "thefuck"
# Monitor data's progress through a pipe
brew "pv"
# Instant coding answers via the command-line
brew "howdoi"
# Statistics utility to count lines of code
brew "cloc"
# Identify or delete duplicate files
brew "fdupes"
brew "npm"
brew "yarn"
#############################
cask "kap"
cask "amethyst"
cask "diffmerge"
cask "balenaetcher"
cask "brave-browser"
cask "ccleaner"
cask "cryptomator"
cask "disk-inventory-x"
cask "docker"
# Run containers through a simple, yet powerful graphical user interface.
cask "kitematic"
cask "dbvisualizer"
cask "firefox"
cask "flux"
cask "integrity"
cask "istumbler"
cask "iterm2"
cask "adoptopenjdk"
cask "jdownloader"
cask "keka"
cask "dupeguru"
cask "iina"
cask "qtpass"
cask "keybase"
cask "macs-fan-control"
cask "jeromelebel-mongohub"
cask "mysqlworkbench"
cask "numi"
cask "onyx"
cask "opera"
cask "osxfuse"
cask "parsehub"
cask "webstorm"
cask "phpstorm"
cask "sublime-text"
cask "visual-studio-code"
cask "postman"
cask "rocket-chat"
cask "discord"
cask "telegram"
cask "robo-3t"
cask "sdformatter"
cask "dbeaver-community"
cask "sequel-pro"
# nosqlbooster-for-mongodb
cask "nosqlbooster-for-mongodb"
cask "postico"
cask "spectacle"
cask "db-browser-for-sqlite"
cask "srware-iron"
cask "tor-browser"
cask "transmission"
cask "vlc"
cask "mpv"
cask "gisto"
cask "typora"
cask "marp"
cask "vnc-viewer"
cask "transmit-disk"
cask "karabiner-elements"
cask "gpg-suite"
cask "font-fontawesome"
cask "font-awesome-terminal-fonts"
cask "font-hack"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-g-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro"
cask "0-ad"
mas "Xcode", id: 497799835
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
